window.DEFAULT_CONFIG = [
  {
    "name": "Бытовка \"Рукастик\" (Премиум)",
    "sizes": [
      {
        "id": "7x3",
        "name": "7х3",
        "length": 7,
        "width": 3
      },
      {
        "id": "6x3",
        "name": "6х3",
        "length": 6,
        "width": 3
      },
      {
        "id": "5x3",
        "name": "5х3",
        "length": 5,
        "width": 3
      },
      {
        "id": "4x3",
        "name": "4х3",
        "length": 4,
        "width": 3
      },
      {
        "id": "3x3",
        "name": "3х3",
        "length": 3,
        "width": 3
      },
      {
        "id": "7x2.1",
        "name": "7х2.1",
        "length": 7,
        "width": 2.1
      },
      {
        "id": "6x2.1",
        "name": "6х2.1",
        "length": 6,
        "width": 2.1
      },
      {
        "id": "5x2.1",
        "name": "5х2.1",
        "length": 5,
        "width": 2.1
      },
      {
        "id": "4x2.1",
        "name": "4х2.1",
        "length": 4,
        "width": 2.1
      },
      {
        "id": "3x2.1",
        "name": "3х2.1",
        "length": 3,
        "width": 2.1
      }
    ],
    "finishes": [
      {
        "name": "Имитация бруса 'ВС' / ОСБ",
        "prices": {
          "7x3": 132000,
          "6x3": 109000,
          "5x3": 99000,
          "4x3": 79000,
          "3x3": 67000,
          "7x2.1": 96000,
          "6x2.1": 81000,
          "5x2.1": 77000,
          "4x2.1": 67000,
          "3x2.1": 61000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000,
          "7x2.1": 21000,
          "6x2.1": 19000,
          "5x2.1": 19000,
          "4x2.1": 17000,
          "3x2.1": 16000
        }
      },
      {
        "name": "Имитация бруса 'ВС' / Вагонка 'С'",
        "prices": {
          "7x3": 135000,
          "6x3": 110000,
          "5x3": 99000,
          "4x3": 79000,
          "3x3": 67000,
          "7x2.1": 98000,
          "6x2.1": 82000,
          "5x2.1": 78000,
          "4x2.1": 68000,
          "3x2.1": 61000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000,
          "7x2.1": 21000,
          "6x2.1": 19000,
          "5x2.1": 19000,
          "4x2.1": 17000,
          "3x2.1": 16000
        }
      },
      {
        "name": "Имитация бруса / ОСБ + дровник",
        "prices": {
          "7x3": 149000,
          "6x3": 114000,
          "5x3": 102000,
          "4x3": 82000,
          "3x3": 69000,
          "7x2.1": 98000,
          "6x2.1": 84000,
          "5x2.1": 79000,
          "4x2.1": 69000,
          "3x2.1": 63000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000
        }
      },
      {
        "name": "Имитация бруса / Вагонка + дровник",
        "prices": {
          "7x3": 152000,
          "6x3": 116000,
          "5x3": 104000,
          "4x3": 83000,
          "3x3": 69000,
          "7x2.1": 99000,
          "6x2.1": 85000,
          "5x2.1": 80000,
          "4x2.1": 70000,
          "3x2.1": 63000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000
        }
      },
      {
        "name": "Имитация бруса / ОСБ + веранда + 2 м",
        "prices": {
          "7x3": 178000,
          "6x3": 165000,
          "5x3": 155000,
          "4x3": 125000,
          "3x3": 105000,
          "7x2.1": 151000,
          "6x2.1": 134000,
          "5x2.1": 132000,
          "4x2.1": 99000,
          "3x2.1": 88000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000
        }
      },
      {
        "name": "Имитация бруса / Вагонка + веранда + 2 м",
        "prices": {
          "7x3": 180000,
          "6x3": 167000,
          "5x3": 156000,
          "4x3": 126000,
          "3x3": 105000,
          "7x2.1": 150000,
          "6x2.1": 136000,
          "5x2.1": 130000,
          "4x2.1": 98000,
          "3x2.1": 88000
        },
        "assembly": {
          "7x3": 25000,
          "6x3": 22000,
          "5x3": 22000,
          "4x3": 17000,
          "3x3": 17000
        }
      },
      {
        "name": "Имитация бруса / ХОЗБЛОК",
        "prices": {
          "7x3": 95000,
          "6x3": 75000,
          "5x3": 73000,
          "4x3": 65000,
          "3x3": 54000,
          "7x2.1": 72000,
          "6x2.1": 62000,
          "5x2.1": 58000,
          "4x2.1": 51000,
          "3x2.1": 45000
        },
        "assembly": {
          "6x3": 17000,
          "5x3": 16000,
          "4x3": 14000,
          "3x3": 10000,
          "6x2.1": 14000,
          "5x2.1": 13000,
          "4x2.1": 11000,
          "3x2.1": 10000
        }
      },
      {
        "name": "ХОЗБЛОК / Дровник",
        "prices": {
          "7x3": 100000,
          "6x3": 80000,
          "5x3": 76000,
          "4x3": 66000,
          "3x3": 56000,
          "7x2.1": 73000,
          "6x2.1": 63000,
          "5x2.1": 61000,
          "4x2.1": 53000,
          "3x2.1": 47000
        },
        "assembly": {
          "6x3": 17000,
          "5x3": 16000,
          "4x3": 14000,
          "3x3": 10000,
          "6x2.1": 14000,
          "5x2.1": 13000,
          "4x2.1": 11000,
          "3x2.1": 10000
        }
      },
      {
        "name": "ХОЗБЛОК / Веранда",
        "prices": {
          "7x3": 158000,
          "6x3": 140000,
          "5x3": 127000,
          "4x3": 111000,
          "3x3": 96000,
          "7x2.1": 133000,
          "6x2.1": 118000,
          "5x2.1": 110000,
          "4x2.1": 0,
          "3x2.1": 0
        },
        "assembly": {
          "6x3": 17000,
          "5x3": 16000,
          "4x3": 14000,
          "3x3": 10000,
          "6x2.1": 14000,
          "5x2.1": 13000,
          "4x2.1": 11000,
          "3x2.1": 10000
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_18",
        "name": "Пол ОСБ 18 мм",
        "prices": {
          "7x3": 7500,
          "6x3": 6500,
          "5x3": 6000,
          "4x3": 5000,
          "3x3": 5000,
          "7x2.1": 7500,
          "6x2.1": 6500,
          "5x2.1": 6000,
          "4x2.1": 5000,
          "3x2.1": 5000
        }
      },
      {
        "id": "linoleum",
        "name": "Линолеум",
        "prices": {
          "7x3": 15000,
          "6x3": 11000,
          "5x3": 8500,
          "4x3": 8000,
          "3x3": 6000,
          "7x2.1": 15000,
          "6x2.1": 11000,
          "5x2.1": 8500,
          "4x2.1": 8000,
          "3x2.1": 6000
        }
      },
      {
        "id": "rodent_mesh",
        "name": "Решетка от грызунов 1-2 мм",
        "prices": {
          "7x3": 10000,
          "6x3": 9000,
          "5x3": 8500,
          "4x3": 6000,
          "3x3": 5500,
          "7x2.1": 10000,
          "6x2.1": 9000,
          "5x2.1": 8500,
          "4x2.1": 6000,
          "3x2.1": 5500
        }
      },
      {
        "id": "close_bottom_boards",
        "name": "Закрыть дно досками",
        "prices": {
          "7x3": 7000,
          "6x3": 6000,
          "5x3": 5000,
          "4x3": 2500,
          "3x3": 2500,
          "7x2.1": 7000,
          "6x2.1": 6000,
          "5x2.1": 5000,
          "4x2.1": 2500,
          "3x2.1": 2500
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100-ка",
        "prices": {
          "7x3": 21000,
          "6x3": 18000,
          "5x3": 15000,
          "4x3": 12000,
          "3x3": 9000,
          "7x2.1": 21000,
          "6x2.1": 18000,
          "5x2.1": 15000,
          "4x2.1": 12000,
          "3x2.1": 9000
        }
      }
    ],
    "additions": [
      {
        "id": "ruk_add_43",
        "name": "Окно дер, 2 осткл, 57/87 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_44",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_45",
        "name": "Окно ПВХ повр-отк 60*90 см",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_46",
        "name": "Окно ПВХ повр-отк 100х100",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_47",
        "name": "Окно ПВХ повр-отк 120*140",
        "price": 14000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_48",
        "name": "Окно ПВХ 50*50 открывающееся",
        "price": 4500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_49",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_50",
        "name": "Дверь филёнчатая межкомнатн. 60-90 см",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_51",
        "name": "Дверь ПВХ от 18000 р. (уточнять)",
        "price": 18000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_52",
        "name": "Дверь вход дерево каркасная самонаборная",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_53",
        "name": "Замена ОСБ на вагонку БС, 100 р/м2",
        "price": 100,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_54",
        "name": "Замена ОСБ на вагонку А, 300 р/м2",
        "price": 300,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_55",
        "name": "Замена ОСБ на имитацию Б, 100 р/м2",
        "price": 100,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_57",
        "name": "Замена вагонки БС на имитацию Б, 250 р/м2",
        "price": 0,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_60",
        "name": "Замена доска 25/150 на 50/150, 500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_61",
        "name": "Перегородка (3 м) ОСБ/ВАГ с дверью ОСБ (9 см)",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_62",
        "name": "Перегородка Вагонка (2 м) с дверью вагонка (9 см)",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_63",
        "name": "Перегородка (3 м) ХБ",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_64",
        "name": "Перегородка (2 м) ХБ",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_65",
        "name": "Крыша двухскатная, 1800 р/м2 по полу (конек 50-60 см)",
        "price": 1800,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_66",
        "name": "ПРОФЛИСТ ОКРАШЕННЫЙ, 300 р/м2, односкатная крыша",
        "price": 300,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_68",
        "name": "Металлочерепица, 1000 р/м2+ветровики",
        "price": 1000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_69",
        "name": "Потолок подшить веранды, 500 р/м2",
        "price": 500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "ruk_add_70",
        "name": "Пароизоляция, 1300 р/мп по длине",
        "price": 1300,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_71",
        "name": "Замена каркаса 40/50 на 50/100, 1200 р/мп (по длине)",
        "price": 1200,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_74",
        "name": "Шпунтованный пол, 36 мм, 1250 р/м2",
        "price": 1250,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "ruk_add_75",
        "name": "ОСБ 9 мм сверху 25/150 мм доски обрезной 25/150 мм",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 50,
      "basePrice": 13000,
      "pricePerKm": 50,
      "notes": "Доставка: до 50 км = 13000 р. свыше 1 км * 50 р"
    }
  },
  {
    "name": "Дачный дом \"Каркасный\"",
    "sizes": [
      {
        "id": "6x3",
        "name": "6х3",
        "length": 6,
        "width": 3
      },
      {
        "id": "7x3",
        "name": "7х3",
        "length": 7,
        "width": 3
      },
      {
        "id": "6x4",
        "name": "6х4",
        "length": 6,
        "width": 4
      },
      {
        "id": "6x5",
        "name": "6х5",
        "length": 6,
        "width": 5
      },
      {
        "id": "6x6",
        "name": "6х6",
        "length": 6,
        "width": 6
      },
      {
        "id": "6x7",
        "name": "6х7",
        "length": 6,
        "width": 7
      },
      {
        "id": "6x8",
        "name": "6х8",
        "length": 6,
        "width": 8
      }
    ],
    "finishes": [
      {
        "name": "Вагонка 'ВС' / Вагонка 'ВС'",
        "prices": {
          "6x3": 225000,
          "7x3": 262500,
          "6x4": 300000,
          "6x5": 375000,
          "6x6": 450000,
          "6x7": 525000,
          "6x8": 600000
        },
        "assembly": {
          "6x3": 0,
          "7x3": 0,
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x7": 0,
          "6x8": 0
        }
      },
      {
        "name": "Имитация бруса 'ВС' / Вагонка 'ВС'",
        "prices": {
          "6x3": 240750,
          "7x3": 280000,
          "6x4": 317500,
          "6x5": 394250,
          "6x6": 471000,
          "6x7": 547750,
          "6x8": 624500
        },
        "assembly": {
          "6x3": 0,
          "7x3": 0,
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x7": 0,
          "6x8": 0
        }
      },
      {
        "name": "Веранда 2м (Вагонка)",
        "prices": {
          "6x4": 231600,
          "6x5": 289860,
          "6x6": 360000
        },
        "assembly": {
          "6x3": 0,
          "7x3": 0,
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x7": 0,
          "6x8": 0
        }
      },
      {
        "name": "Веранда 2м (Имитация)",
        "prices": {
          "6x4": 249840,
          "6x5": 310140,
          "6x6": 367720
        },
        "assembly": {
          "6x3": 0,
          "7x3": 0,
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x7": 0,
          "6x8": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_12",
        "name": "Пол ОСБ 12 мм",
        "prices": {
          "6x3": 9000,
          "7x3": 10500,
          "6x4": 12000,
          "6x5": 15000,
          "6x6": 18000,
          "6x7": 21000,
          "6x8": 24000
        }
      },
      {
        "id": "floor_35mm",
        "name": "Пол доска обрезная 35 мм",
        "prices": {
          "6x3": 9000,
          "7x3": 10500,
          "6x4": 12000,
          "6x5": 15000,
          "6x6": 18000,
          "6x7": 21000,
          "6x8": 24000
        }
      },
      {
        "id": "floor_tongue",
        "name": "Пол доска шпунтованная",
        "prices": {
          "6x3": 18000,
          "7x3": 21000,
          "6x4": 24000,
          "6x5": 30000,
          "6x6": 36000,
          "6x7": 42000,
          "6x8": 48000
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100 мм",
        "prices": {
          "6x3": 0,
          "7x3": 0,
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x7": 0,
          "6x8": 0
        }
      },
      {
        "id": "insulation_150",
        "name": "Утеплитель 150 мм (базальт. плита)",
        "prices": {
          "6x3": 63000,
          "7x3": 73500,
          "6x4": 84000,
          "6x5": 105000,
          "6x6": 126000,
          "6x7": 147000,
          "6x8": 168000
        }
      }
    ],
    "additions": [
      {
        "id": "dom_add_15",
        "name": "Окно дер, 2 осткл, 70*80 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_16",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_17",
        "name": "Окно ПВХ 50х50",
        "price": 5500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_18",
        "name": "Окно ПВХ повр-отк 60Ш*90В см",
        "price": 7500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_19",
        "name": "Окно 1500х1500",
        "price": 17500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_20",
        "name": "Окно ПВХ повр-отк 100х100",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_21",
        "name": "Окно ПВХ повр-отк 100х120",
        "price": 11000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_22",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_23",
        "name": "Дверь филенчатая межкомнатн.",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_24",
        "name": "Дверь вход дерево каркасная самонаборная",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_25",
        "name": "Замена ОСБ на вагонку БС, 120 р/м2",
        "price": 120,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_26",
        "name": "Замена ОСБ на вагонку А, 500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_27",
        "name": "Замена ОСБ на имитацию Б, 350 р/м2",
        "price": 350,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_28",
        "name": "Замена вагонки Б на блокхаус, 1000 р/м2",
        "price": 1000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_29",
        "name": "Замена вагонки БС на имитацию Б, 250 р/м2",
        "price": 250,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_30",
        "name": "Замена вагонки БС на имитацию А, 400 р/м2",
        "price": 400,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_31",
        "name": "Замена вагонка ВС на ОСБ 12",
        "price": 300,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_32",
        "name": "Замена доска 25/150 на 35/150, 500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_33",
        "name": "Замена вагонки на профлист, 400 р/м2",
        "price": 400,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_34",
        "name": "Перегор. ВАГОНКА \"С\", 4000 р/мп (с 100 ут), 3200 рмп.",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_35",
        "name": "Перегор. ИМИТАЦИЯ БРУСА, 4000 р/мп",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_36",
        "name": "Имитация БС +400 р/м2 (к вагонке БС)",
        "price": 120,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_37",
        "name": "Имитация АБ +650 р/м2",
        "price": 650,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_38",
        "name": "базальт плита, +1000 р/м2 35 плотность Изобель, стены",
        "price": 1000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_39",
        "name": "базальт плита, +300 р/м2 25 плотность Изобель, стены",
        "price": 300,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_40",
        "name": "Металлочерепица, 1500 р/м2 (+2 кв.м)",
        "price": 1500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_41",
        "name": "Профлист окраш С8 (0,4) +750 р/м2",
        "price": 750,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_42",
        "name": "Профлист окраш С8 (0,4) +500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_43",
        "name": "ПВХ 2000х1500",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_44",
        "name": "Дверь входная ПВХ",
        "price": 23000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_45",
        "name": "Дверь филенчатая межкомнатн.",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_46",
        "name": "Сетка от грызунов, м2",
        "price": 400,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_47",
        "name": "Пол, ОСБ 12, 500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_48",
        "name": "Пол, доска обрезная, 35 мм",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_49",
        "name": "Пол, доска шпунтованная,",
        "price": 1000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "dom_add_50",
        "name": "Свесы (карнизы) 30 см сразу, если 6х6 и 6х8",
        "price": 1200,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_51",
        "name": "Поднятие высоты",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "dom_add_52",
        "name": "Сваи, 2000/76, 4000 р/шт.",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 50,
      "basePrice": 13000,
      "pricePerKm": 100,
      "notes": "Доставка свыше 250 км по 250 р/км"
    }
  },
  {
    "name": "Бытовка А. Корнилова",
    "sizes": [
      {
        "id": "2x2.1",
        "name": "2х2.1",
        "length": 2,
        "width": 2.1
      },
      {
        "id": "3x2.1",
        "name": "3х2.1",
        "length": 3,
        "width": 2.1
      },
      {
        "id": "4x2.1",
        "name": "4х2.1",
        "length": 4,
        "width": 2.1
      },
      {
        "id": "5x2.1",
        "name": "5х2.1",
        "length": 5,
        "width": 2.1
      },
      {
        "id": "6x2.1",
        "name": "6х2.1",
        "length": 6,
        "width": 2.1
      },
      {
        "id": "7x2.5",
        "name": "7х2.5",
        "length": 7,
        "width": 2.5
      },
      {
        "id": "3x3",
        "name": "3х3",
        "length": 3,
        "width": 3
      },
      {
        "id": "4x3",
        "name": "4х3",
        "length": 4,
        "width": 3
      },
      {
        "id": "5x3",
        "name": "5х3",
        "length": 5,
        "width": 3
      },
      {
        "id": "6x3",
        "name": "6х3",
        "length": 6,
        "width": 3
      },
      {
        "id": "7x3",
        "name": "7х3",
        "length": 7,
        "width": 3
      }
    ],
    "finishes": [
      {
        "name": "Вагонка 'ВС' / ОСБ",
        "prices": {
          "2x2.1": 52000,
          "3x2.1": 60000,
          "4x2.1": 67000,
          "5x2.1": 75000,
          "6x2.1": 79000,
          "7x2.5": 92000,
          "3x3": 74000,
          "4x3": 84000,
          "5x3": 106000,
          "6x3": 109000,
          "7x3": 112000
        },
        "assembly": {
          "2x2.1": 12000,
          "3x2.1": 16000,
          "4x2.1": 17000,
          "5x2.1": 19000,
          "6x2.1": 19000,
          "7x2.5": 21000,
          "3x3": 17000,
          "4x3": 17000,
          "5x3": 22000,
          "6x3": 22000,
          "7x3": 25000
        }
      },
      {
        "name": "ХОЗБЛОК",
        "prices": {
          "2x2.1": 45000,
          "3x2.1": 45000,
          "4x2.1": 50000,
          "5x2.1": 56000,
          "6x2.1": 59000,
          "7x2.5": 75000,
          "3x3": 54000,
          "4x3": 63000,
          "5x3": 71000,
          "6x3": 75000
        },
        "assembly": {
          "2x2.1": 10000,
          "3x2.1": 10000,
          "4x2.1": 11000,
          "5x2.1": 13000,
          "6x2.1": 14000,
          "7x2.5": 18000,
          "3x3": 10000,
          "4x3": 14000,
          "5x3": 16000,
          "6x3": 17000,
          "7x3": 18000
        }
      },
      {
        "name": "Веранда 2м / ОСБ",
        "prices": {
          "6x2.1": 148000,
          "3x3": 7500
        },
        "assembly": {
          "2x2.1": 12000,
          "3x2.1": 16000,
          "4x2.1": 17000,
          "5x2.1": 19000,
          "6x2.1": 19000,
          "7x2.5": 21000,
          "3x3": 17000,
          "4x3": 17000,
          "5x3": 22000,
          "6x3": 22000,
          "7x3": 25000
        }
      },
      {
        "name": "Веранда 2м / Вагонка",
        "prices": {
          "3x3": 9500
        },
        "assembly": {
          "2x2.1": 12000,
          "3x2.1": 16000,
          "4x2.1": 17000,
          "5x2.1": 19000,
          "6x2.1": 19000,
          "7x2.5": 21000,
          "3x3": 17000,
          "4x3": 17000,
          "5x3": 22000,
          "6x3": 22000,
          "7x3": 25000
        }
      }
    ],
    "floorOptions": [],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100 мм",
        "prices": {
          "2x2.1": 0,
          "3x2.1": 0,
          "4x2.1": 0,
          "5x2.1": 0,
          "6x2.1": 0,
          "7x2.5": 0,
          "3x3": 0,
          "4x3": 0,
          "5x3": 0,
          "6x3": 0,
          "7x3": 0
        }
      }
    ],
    "additions": [
      {
        "id": "cab_add_20",
        "name": "Окно дер, 2 осткл, 60/90см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_21",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_22",
        "name": "Окно ПВХ повр-отк60*90 см",
        "price": 7500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_23",
        "name": "Окно ПВХ повр-отк 100х100",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_24",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_25",
        "name": "Дверь филенчатая межкомнатн.",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_26",
        "name": "Дверь вход дерево каркасная самонаборная 1,4 м распаш.",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_27",
        "name": "Пандус, шт.",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_28",
        "name": "Утеплитель мин. вата 100 мм, 550 р/м2 по полу",
        "price": 550,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_29",
        "name": "ПРОФЛИСТ, 22000 (6х2,5 с крышей)",
        "price": 22000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_30",
        "name": "Замена ОСБ на вагонку БС, 120 р/м2",
        "price": 120,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_31",
        "name": "Замена ОСБ на вагонку А, 500 р/м2",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_32",
        "name": "Замена ОСБ на имитацию Б, 350 р/м2",
        "price": 350,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_33",
        "name": "Замена вагонки Б на блокхаус, 1000 р/м2",
        "price": 1000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_34",
        "name": "Замена вагонки БС на имитацию Б, 250 р/м2",
        "price": 250,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_35",
        "name": "Замена вагонки БС на имитацию А, 400 р/м2",
        "price": 400,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_36",
        "name": "Перегор. ВАГОНКА \"С\", 3500 р/мп",
        "price": 3500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_37",
        "name": "Перегор. ИМИТАЦИЯ БРУСА, 4000 р/мп",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_38",
        "name": "Перегор. ОСБ 9 мм, 3200 р/мп",
        "price": 3200,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_39",
        "name": "Профлист цветной на крыше С8 (0,4)+750 р/м2 (высокая)",
        "price": 750,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_40",
        "name": "Профлист цветной на крыше С8 (0,4)+500 р/м2 (низкая)",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_41",
        "name": "Металлочерепица,1500/м2 (высокая кр.) * S пола",
        "price": 1500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_42",
        "name": "Металлочерепица,800р/м2 (низкая крыша) * S пола",
        "price": 800,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_43",
        "name": "пол ОСБ 12, 500 р/м2 (бытовки, ломаная)",
        "price": 500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_44",
        "name": "Потолок зашить ОСБ, 1000 р/м2",
        "price": 1000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_45",
        "name": "Перенос материала, более 20 м, 3000 р.",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_46",
        "name": "Генератор (без электрики) участок, 2500 р.",
        "price": 2500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_47",
        "name": "ПВХ 2000х1500",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_48",
        "name": "Дверь входная ПВХ",
        "price": 23000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_49",
        "name": "Сетка от грызунов, м2",
        "price": 400,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "cab_add_50",
        "name": "Свесы (карнизы)",
        "price": 28000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "cab_add_51",
        "name": "Поднятие высоты",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 50,
      "basePrice": 6000,
      "pricePerKm": 80,
      "notes": "2 доставки по 200 р/км, минимум 6000 р."
    }
  },
  {
    "name": "Бытовка \"Бюджет\" (Марусино)",
    "sizes": [
      {
        "id": "7x2.3",
        "name": "7х2.3",
        "length": 7,
        "width": 2.3
      },
      {
        "id": "6x2.3",
        "name": "6х2.3",
        "length": 6,
        "width": 2.3
      },
      {
        "id": "5x2.3",
        "name": "5х2.3",
        "length": 5,
        "width": 2.3
      },
      {
        "id": "4x2.3",
        "name": "4х2.3",
        "length": 4,
        "width": 2.3
      },
      {
        "id": "3x2.3",
        "name": "3х2.3",
        "length": 3,
        "width": 2.3
      },
      {
        "id": "2x2",
        "name": "2х2",
        "length": 2,
        "width": 2
      }
    ],
    "finishes": [
      {
        "name": "Вагонка / ДВП",
        "prices": {
          "7x2.3": 85000,
          "6x2.3": 80000,
          "5x2.3": 77000,
          "4x2.3": 72000,
          "3x2.3": 67000,
          "2x2": 52000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "Вагонка / ОСБ",
        "prices": {
          "7x2.3": 105000,
          "6x2.3": 95000,
          "5x2.3": 90000,
          "4x2.3": 82000,
          "3x2.3": 65000,
          "2x2": 58000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "Вагонка / Вагонка",
        "prices": {
          "7x2.3": 110000,
          "6x2.3": 100000,
          "5x2.3": 95000,
          "4x2.3": 86000,
          "3x2.3": 78000,
          "2x2": 60000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / ДВП",
        "prices": {
          "7x2.3": 95000,
          "6x2.3": 85000,
          "5x2.3": 82000,
          "4x2.3": 77000,
          "3x2.3": 72000,
          "2x2": 57000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / ОСБ",
        "prices": {
          "7x2.3": 110000,
          "6x2.3": 100000,
          "5x2.3": 95000,
          "4x2.3": 87000,
          "3x2.3": 80000,
          "2x2": 63000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / Ваг",
        "prices": {
          "7x2.3": 115000,
          "6x2.3": 105000,
          "5x2.3": 100000,
          "4x2.3": 91000,
          "3x2.3": 83000,
          "2x2": 65000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / ДВП",
        "prices": {
          "7x2.3": 96000,
          "6x2.3": 86000,
          "5x2.3": 83000,
          "4x2.3": 78000,
          "3x2.3": 73000,
          "2x2": 58000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / ОСБ",
        "prices": {
          "7x2.3": 111000,
          "6x2.3": 101000,
          "5x2.3": 96000,
          "4x2.3": 88000,
          "3x2.3": 81000,
          "2x2": 64000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / Ваг",
        "prices": {
          "7x2.3": 116000,
          "6x2.3": 106000,
          "5x2.3": 101000,
          "4x2.3": 92000,
          "3x2.3": 84000,
          "2x2": 66000
        },
        "assembly": {
          "7x2.3": 0,
          "6x2.3": 0,
          "5x2.3": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "2x2": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_12",
        "name": "Пол ОСБ 12 мм",
        "prices": {
          "7x2.3": 3000,
          "6x2.3": 2000,
          "5x2.3": 2000,
          "4x2.3": 2000,
          "3x2.3": 2000
        }
      },
      {
        "id": "linoleum_office",
        "name": "Линолеум полукоммерческий",
        "prices": {
          "7x2.3": 12000,
          "6x2.3": 10500,
          "5x2.3": 7000,
          "4x2.3": 6500,
          "3x2.3": 6000
        }
      },
      {
        "id": "linoleum_mall",
        "name": "Линолеум коммерческий",
        "prices": {
          "7x2.3": 12000,
          "6x2.3": 10500,
          "5x2.3": 9000,
          "4x2.3": 7000,
          "3x2.3": 7000
        }
      },
      {
        "id": "rodent_mesh",
        "name": "Решетка от грызунов",
        "prices": {
          "7x2.3": 10000,
          "6x2.3": 9000,
          "5x2.3": 8500,
          "4x2.3": 6000,
          "3x2.3": 5500
        }
      },
      {
        "id": "close_bottom_boards",
        "name": "Закрыть дно досками",
        "prices": {
          "7x2.3": 7000,
          "6x2.3": 6000,
          "5x2.3": 5000,
          "4x2.3": 2500,
          "3x2.3": 2500
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100-ка",
        "prices": {
          "7x2.3": 16000,
          "6x2.3": 14000,
          "5x2.3": 10000,
          "4x2.3": 8000,
          "3x2.3": 6000
        }
      }
    ],
    "additions": [
      {
        "id": "mar_add_21",
        "name": "Окно дер, 2 осткл, 70*80 см",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_22",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_23",
        "name": "Окно ПВХ повр-отк 60*90 см",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_24",
        "name": "Окно ПВХ повр-отк 1*1 м",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_25",
        "name": "Ставни каркас обшиты профлист/ваг",
        "price": 3000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "mar_add_26",
        "name": "Решетка на окно Металл",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_27",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 14000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_28",
        "name": "Увел. Высоты при замене двери на Металл.!! 2,2м",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_29",
        "name": "Увел.высоты max до 2,4м (до 2,2 м) на 20 см",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_30",
        "name": "Дверь вход дерево каркасная",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_31",
        "name": "Перегор. ДВП без утеплит до 2,2м",
        "price": 5000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_32",
        "name": "Перегор. ДВП с утеплит +50мм до 2,2м",
        "price": 7000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_33",
        "name": "Перегор. ДВП без утеплит+100мм от 2,2м",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_34",
        "name": "Перегородка ОСБ/Ваг до 2,2 м без утепл.",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_35",
        "name": "Перегородка ОСБ/Ваг от 2,2 м с утеп.50 мм",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_36",
        "name": "Перегор ОСБ/Ваг с утепл. 100мм",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_37",
        "name": "Туалет односкатная крыша без внутр.отделки",
        "price": 11500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "mar_add_38",
        "name": "Туалет с двухскатной крышей без внутр.отд.",
        "price": 20000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_39",
        "name": "Электрика автомат, кор-распределитель",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_40",
        "name": "Доп.точка электрики 1 шт",
        "price": 900,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_41",
        "name": "Покраска масл.краска (2 слоя видно, 1 сл.впитывается)",
        "price": 7000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "mar_add_42",
        "name": "Покраска краской белой бруса каркаса, наличники",
        "price": 2000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "mar_add_43",
        "name": "Профлист цветной на крыше",
        "price": 8000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "mar_add_44",
        "name": "Шконка",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_45",
        "name": "Стол",
        "price": 3600,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_46",
        "name": "Дровник",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "mar_add_47",
        "name": "Дверь входная ПВХ",
        "price": 30000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 70,
      "basePrice": 12000,
      "pricePerKm": 120,
      "notes": "Доставка до 70 км = 12000 р. Свыше 1 км * 120 р"
    }
  },
  {
    "name": "Блок-контейнер \"Стандарт\" (Марусино)",
    "sizes": [
      {
        "id": "7x2.43",
        "name": "7х2.43",
        "length": 7,
        "width": 2.43
      },
      {
        "id": "6x2.4",
        "name": "6х2.4",
        "length": 6,
        "width": 2.4
      },
      {
        "id": "5x2.43",
        "name": "5х2.43",
        "length": 5,
        "width": 2.43
      },
      {
        "id": "4x2.3",
        "name": "4х2.3",
        "length": 4,
        "width": 2.3
      },
      {
        "id": "3x2.3",
        "name": "3х2.3",
        "length": 3,
        "width": 2.3
      },
      {
        "id": "frame",
        "name": "Каркас",
        "length": 6,
        "width": 2.4
      }
    ],
    "finishes": [
      {
        "name": "С8 / ДВП",
        "prices": {
          "7x2.43": 143000,
          "6x2.4": 125000,
          "5x2.43": 118000,
          "4x2.3": 112000,
          "3x2.3": 106000,
          "frame": 58000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "С8 / ОСБ",
        "prices": {
          "7x2.43": 162000,
          "6x2.4": 143000,
          "5x2.43": 135000,
          "4x2.3": 125000,
          "3x2.3": 116000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "С8 / Ваг",
        "prices": {
          "7x2.43": 168000,
          "6x2.4": 150000,
          "5x2.43": 141000,
          "4x2.3": 130000,
          "3x2.3": 120000,
          "frame": 56000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "С8 / Без отделки",
        "prices": {
          "7x2.43": 125000,
          "6x2.4": 118000,
          "5x2.43": 112000,
          "4x2.3": 106000,
          "3x2.3": 100000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "С8 / МДФ",
        "prices": {
          "7x2.43": 181000,
          "6x2.4": 162000,
          "5x2.43": 151000,
          "4x2.3": 137000,
          "3x2.3": 126000,
          "frame": 53000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "С8 / ПВХ",
        "prices": {
          "7x2.43": 181000,
          "6x2.4": 162000,
          "5x2.43": 151000,
          "4x2.3": 137000,
          "3x2.3": 126000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "Вагонка / ДВП",
        "prices": {
          "7x2.43": 162000,
          "6x2.4": 143000,
          "5x2.43": 137000,
          "4x2.3": 131000,
          "3x2.3": 125000,
          "frame": 51000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "Вагонка / ОСБ",
        "prices": {
          "7x2.43": 181000,
          "6x2.4": 162000,
          "5x2.43": 153000,
          "4x2.3": 143000,
          "3x2.3": 135000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      },
      {
        "name": "Вагонка / Вагонка",
        "prices": {
          "7x2.43": 187000,
          "6x2.4": 168000,
          "5x2.43": 160000,
          "4x2.3": 148000,
          "3x2.3": 138000,
          "frame": 49000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0,
          "frame": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_18",
        "name": "Пол ОСБ 18 мм",
        "prices": {
          "7x2.43": 8000,
          "6x2.4": 6500,
          "5x2.43": 6000,
          "4x2.3": 5000,
          "3x2.3": 5000
        }
      },
      {
        "id": "linoleum_office",
        "name": "Линолеум полукоммерческий",
        "prices": {
          "7x2.43": 15000,
          "6x2.4": 10000,
          "5x2.43": 7000,
          "4x2.3": 6000,
          "3x2.3": 5000
        }
      },
      {
        "id": "linoleum_mall",
        "name": "Линолеум коммерческий",
        "prices": {
          "7x2.43": 15000,
          "6x2.4": 10500,
          "5x2.43": 9000,
          "4x2.3": 7500,
          "3x2.3": 6000
        }
      },
      {
        "id": "rodent_mesh",
        "name": "Решетка от грызунов",
        "prices": {
          "7x2.43": 12500,
          "6x2.4": 11500,
          "5x2.43": 11000,
          "4x2.3": 7500,
          "3x2.3": 7000
        }
      },
      {
        "id": "close_bottom_boards",
        "name": "Закрыть дно досками",
        "prices": {
          "7x2.43": 12500,
          "6x2.4": 7500,
          "5x2.43": 6500,
          "4x2.3": 3500,
          "3x2.3": 3500
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100-ка",
        "prices": {
          "7x2.43": 20000,
          "6x2.4": 18000,
          "5x2.43": 12500,
          "4x2.3": 10000,
          "3x2.3": 7500
        }
      }
    ],
    "additions": [
      {
        "id": "bk_add_21",
        "name": "Окно дер, 2 осткл, 70*80 см",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_22",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_23",
        "name": "Окно ПВХ повр-отк 60*90 см",
        "price": 11500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_24",
        "name": "Окно ПВХ повр-отк 1*1 м",
        "price": 12500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_25",
        "name": "Окно ПВХ повр-отк 800х2000 м",
        "price": 25000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_26",
        "name": "Ставни каркас обшиты профлист/ваг",
        "price": 4000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_27",
        "name": "Решетка на окно Металлическая",
        "price": 5000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_28",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 17500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_29",
        "name": "Увел.высоты max до 2,4м (на 20 см)",
        "price": 12500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_30",
        "name": "Дверь вход дерево каркасная",
        "price": 6500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_31",
        "name": "Крыша односкатная",
        "price": 7500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_32",
        "name": "Перегор. ДВП без утеплит до 2,2м",
        "price": 6500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_33",
        "name": "Перегор. ДВП с утеплит +50мм",
        "price": 7500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_34",
        "name": "Перегор. ДВП с утеплит+100мм",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_35",
        "name": "Перегородка ОСБ/Ваг до 2,2 м без утепл.",
        "price": 7500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_36",
        "name": "Перегородка ОСБ/Ваг от 2,2 м с утеп.50 мм",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_37",
        "name": "Перегор ОСБ/Ваг с утепл. 100мм",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_38",
        "name": "Туалет односкатная крыша без внутр.отделки",
        "price": 11500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_39",
        "name": "Туалет с двухскатной крышей без внутр.отделки",
        "price": 20000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_40",
        "name": "Электрика автомат, кор-распределитель",
        "price": 6500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_41",
        "name": "Доп.точка электрики 1 шт",
        "price": 900,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_42",
        "name": "Покраска масл.краска (2 слоя видно, 1 сл.впитывается)",
        "price": 9000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_43",
        "name": "Профлист цветной на крыше (0,4)",
        "price": 10000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_44",
        "name": "Профлист стены (коричн, зелен, кр, серый)",
        "price": 6500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "bk_add_45",
        "name": "Шконка",
        "price": 4500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_46",
        "name": "Стол 1000х800",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "bk_add_47",
        "name": "Дверь входная ПВХ",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 70,
      "basePrice": 12000,
      "pricePerKm": 120,
      "notes": "Доставка до 70 км = 12000 р. Свыше 1 км * 120 р"
    }
  },
  {
    "name": "Дачный дом \"Дачник\" (Фрязино)",
    "sizes": [
      {
        "id": "6x4",
        "name": "6х4",
        "length": 6,
        "width": 4
      },
      {
        "id": "6x5",
        "name": "6х5",
        "length": 6,
        "width": 5
      },
      {
        "id": "6x6",
        "name": "6х6",
        "length": 6,
        "width": 6
      },
      {
        "id": "6x8",
        "name": "6х8",
        "length": 6,
        "width": 8
      }
    ],
    "finishes": [
      {
        "name": "Вагонка 'АВ' / Вагонка 'АВ'",
        "prices": {
          "6x4": 408000,
          "6x5": 510000,
          "6x6": 612000,
          "6x8": 816000
        },
        "assembly": {
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x8": 0
        }
      },
      {
        "name": "ОСБ / ОСБ + Вагонка 'АВ'",
        "prices": {
          "6x4": 408000,
          "6x5": 510000,
          "6x6": 612000,
          "6x8": 816000
        },
        "assembly": {
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x8": 0
        }
      },
      {
        "name": "Вагонка 'С' / Вагонка 'С'",
        "prices": {
          "6x4": 384000,
          "6x5": 480000,
          "6x6": 576000,
          "6x8": 816000
        },
        "assembly": {
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x8": 0
        }
      },
      {
        "name": "Имитация 'АВ' / Вагонка 'АВ'",
        "prices": {
          "6x4": 420000,
          "6x5": 525000,
          "6x6": 630000,
          "6x8": 816000
        },
        "assembly": {
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x8": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "rodent_mesh",
        "name": "Решетка от грызунов",
        "prices": {
          "6x4": 4200,
          "6x5": 4200,
          "6x6": 4200,
          "6x8": 4200
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100 мм",
        "prices": {
          "6x4": 0,
          "6x5": 0,
          "6x6": 0,
          "6x8": 0
        }
      }
    ],
    "additions": [
      {
        "id": "fry_dom_add_9",
        "name": "Перегородки из вагонки, р/мп",
        "price": 3500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_10",
        "name": "Перегородки из имитации бруса, р/мп",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_12",
        "name": "Решетка на дно от грызунов мелкозернистая, 15 м2",
        "price": 4200,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_13",
        "name": "металлочерепица, р/м2",
        "price": 600,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_14",
        "name": "Утеплитель каменная вата, р/ м2 по полу",
        "price": 1000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_15",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 13000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_16",
        "name": "Дверь филёнчатая межкомнатн.",
        "price": 6200,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_dom_add_17",
        "name": "Дверь вход дерево каркасная наборная",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 200,
      "basePrice": 0,
      "pricePerKm": 0,
      "notes": "Доставка до 200 км входит в стоимость"
    }
  },
  {
    "name": "Бытовка \"Дачная\" (Фрязино)",
    "sizes": [
      {
        "id": "7x2.2",
        "name": "7х2.2",
        "length": 7,
        "width": 2.2
      },
      {
        "id": "6x2.2",
        "name": "6х2.2",
        "length": 6,
        "width": 2.2
      },
      {
        "id": "5x2.2",
        "name": "5х2.2",
        "length": 5,
        "width": 2.2
      },
      {
        "id": "4x2.2",
        "name": "4х2.2",
        "length": 4,
        "width": 2.2
      },
      {
        "id": "3x2.2",
        "name": "3х2.2",
        "length": 3,
        "width": 2.2
      },
      {
        "id": "2x2",
        "name": "2х2",
        "length": 2,
        "width": 2
      }
    ],
    "finishes": [
      {
        "name": "Вагонка / ДВП",
        "prices": {
          "7x2.2": 85000,
          "6x2.2": 71000,
          "5x2.2": 66000,
          "4x2.2": 61000,
          "3x2.2": 56000,
          "2x2": 49000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Вагонка / ОСБ",
        "prices": {
          "7x2.2": 100000,
          "6x2.2": 84000,
          "5x2.2": 77000,
          "4x2.2": 69000,
          "3x2.2": 62000,
          "2x2": 50000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Вагонка / Вагонка",
        "prices": {
          "7x2.2": 105000,
          "6x2.2": 89000,
          "5x2.2": 84000,
          "4x2.2": 78000,
          "3x2.2": 66000,
          "2x2": 57000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "ХОЗБЛОК",
        "prices": {
          "7x2.2": 80000,
          "6x2.2": 66000,
          "5x2.2": 61000,
          "4x2.2": 59000,
          "3x2.2": 53000,
          "2x2": 45000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / ДВП",
        "prices": {
          "7x2.2": 97000,
          "6x2.2": 83000,
          "5x2.2": 78000,
          "4x2.2": 73000,
          "3x2.2": 68000,
          "2x2": 61000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / ОСБ",
        "prices": {
          "7x2.2": 112000,
          "6x2.2": 96000,
          "5x2.2": 89000,
          "4x2.2": 81000,
          "3x2.2": 74000,
          "2x2": 63000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "С8 / Ваг",
        "prices": {
          "7x2.2": 117000,
          "6x2.2": 100000,
          "5x2.2": 96000,
          "4x2.2": 90000,
          "3x2.2": 78000,
          "2x2": 71000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / ДВП",
        "prices": {
          "7x2.2": 95000,
          "6x2.2": 81000,
          "5x2.2": 76000,
          "4x2.2": 71000,
          "3x2.2": 66000,
          "2x2": 58000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / ОСБ",
        "prices": {
          "7x2.2": 110000,
          "6x2.2": 94000,
          "5x2.2": 87000,
          "4x2.2": 79000,
          "3x2.2": 72000,
          "2x2": 59000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Имитация / Ваг",
        "prices": {
          "7x2.2": 115000,
          "6x2.2": 99000,
          "5x2.2": 94000,
          "4x2.2": 88000,
          "3x2.2": 76000,
          "2x2": 68000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл / ДВП",
        "prices": {
          "7x2.2": 104400,
          "6x2.2": 87000,
          "5x2.2": 82000,
          "4x2.2": 78000,
          "3x2.2": 73000,
          "2x2": 68000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл / ОСБ",
        "prices": {
          "7x2.2": 120000,
          "6x2.2": 100000,
          "5x2.2": 93000,
          "4x2.2": 87000,
          "3x2.2": 80000,
          "2x2": 75000
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл / Вагонка С",
        "prices": {
          "7x2.2": 124800,
          "6x2.2": 104000,
          "5x2.2": 96720,
          "4x2.2": 90480,
          "3x2.2": 83200,
          "2x2": 79667
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл / ХБ",
        "prices": {
          "7x2.2": 97200,
          "6x2.2": 81000,
          "5x2.2": 75330,
          "4x2.2": 70470,
          "3x2.2": 64800,
          "2x2": 60750
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл окраш. / ДВП",
        "prices": {
          "7x2.2": 111400,
          "6x2.2": 93000,
          "5x2.2": 86800,
          "4x2.2": 81333,
          "3x2.2": 75500,
          "2x2": 69667
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл окраш. / ОСБ",
        "prices": {
          "7x2.2": 127000,
          "6x2.2": 107000,
          "5x2.2": 97800,
          "4x2.2": 90333,
          "3x2.2": 82500,
          "2x2": 76667
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл окраш. / Вагонка С",
        "prices": {
          "7x2.2": 131800,
          "6x2.2": 110000,
          "5x2.2": 101520,
          "4x2.2": 93813,
          "3x2.2": 85700,
          "2x2": 79667
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      },
      {
        "name": "Металл окраш. / ХБ",
        "prices": {
          "7x2.2": 104200,
          "6x2.2": 87000,
          "5x2.2": 80130,
          "4x2.2": 73803,
          "3x2.2": 67300,
          "2x2": 62417
        },
        "assembly": {
          "7x2.2": 0,
          "6x2.2": 0,
          "5x2.2": 0,
          "4x2.2": 0,
          "3x2.2": 0,
          "2x2": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_18",
        "name": "Пол ОСБ 18 мм",
        "prices": {
          "7x2.2": 7500,
          "6x2.2": 6500,
          "5x2.2": 6000,
          "4x2.2": 5000,
          "3x2.2": 5000
        }
      },
      {
        "id": "linoleum",
        "name": "Линолеум",
        "prices": {
          "7x2.2": 15000,
          "6x2.2": 11000,
          "5x2.2": 8500,
          "4x2.2": 8000,
          "3x2.2": 6000
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100-ка",
        "prices": {
          "7x2.2": 21000,
          "6x2.2": 18000,
          "5x2.2": 15000,
          "4x2.2": 12000,
          "3x2.2": 9000,
          "2x2": 6000
        }
      }
    ],
    "additions": [
      {
        "id": "fry_cab_add_29",
        "name": "Окно деревянное 70*80 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_30",
        "name": "Окно деревяное 50*50 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_31",
        "name": "Окно ПВХ повр-отк 60*90 см",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_32",
        "name": "Окно ПВХ повр-отк 100х100",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_33",
        "name": "Окно ПВХ повр-отк 40х40",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_34",
        "name": "Окно ПВХ повр-отк 100х120",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_35",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 13000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_36",
        "name": "Дверь филёнчатая межкомнатн.",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_37",
        "name": "Дверь вход дерево каркасная наборная",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_38",
        "name": "Перегор. ДВП (1 шт)",
        "price": 5000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_39",
        "name": "Перегородка ОСБ с дверью ОСБ (9 см)",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_40",
        "name": "Перегородка Вагонка с дверью вагонка (9 см)",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_41",
        "name": "Увеличение высоты до 2,4м внутри",
        "price": 13000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_42",
        "name": "Туалет без седушки",
        "price": 13000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_43",
        "name": "Туалет с седушкой",
        "price": 16000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_44",
        "name": "Электрика; розетка, патрон, выключатель",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_45",
        "name": "Доп.точка электрики 1 шт",
        "price": 900,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_46",
        "name": "Оцинкованный профлист С8 (0,35)",
        "price": 12000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_48",
        "name": "Профлист цветной на крыше (0,35)",
        "price": 7500,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_49",
        "name": "Профлист цветной на крыше (0,45)",
        "price": 9000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_50",
        "name": "Дровник",
        "price": 12500,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_51",
        "name": "Веранда",
        "price": 9000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_52",
        "name": "Обработка антисептиком днища",
        "price": 4000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_53",
        "name": "Ветро-влагозащитная пленка",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_54",
        "name": "Двухскатная крыша",
        "price": 17000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_55",
        "name": "лестница для входа",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_56",
        "name": "Сборка на участке",
        "price": 20000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "fry_cab_add_57",
        "name": "ширина 3 м со сборкой на участке",
        "price": 22000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 60,
      "basePrice": 9000,
      "pricePerKm": 140,
      "notes": "Мин ставка 9000 р. До 60 км, свыше 140 р/км манипулятором"
    }
  },
  {
    "name": "Блок-контейнер \"Усиленный\" (Троицк)",
    "sizes": [
      {
        "id": "7x2.43",
        "name": "7х2.43",
        "length": 7,
        "width": 2.43
      },
      {
        "id": "6x2.4",
        "name": "6х2.4",
        "length": 6,
        "width": 2.4
      },
      {
        "id": "5x2.43",
        "name": "5х2.43",
        "length": 5,
        "width": 2.43
      },
      {
        "id": "4x2.3",
        "name": "4х2.3",
        "length": 4,
        "width": 2.3
      },
      {
        "id": "3x2.3",
        "name": "3х2.3",
        "length": 3,
        "width": 2.3
      }
    ],
    "finishes": [
      {
        "name": "С8 / ДВП",
        "prices": {
          "7x2.43": 125000,
          "6x2.4": 110000,
          "5x2.43": 105000,
          "4x2.3": 101000,
          "3x2.3": 94000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "С8 / ОСБ",
        "prices": {
          "7x2.43": 145000,
          "6x2.4": 126000,
          "5x2.43": 121000,
          "4x2.3": 116000,
          "3x2.3": 106000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "С8 / Ваг",
        "prices": {
          "7x2.43": 157000,
          "6x2.4": 125000,
          "5x2.43": 120000,
          "4x2.3": 118000,
          "3x2.3": 106000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "Вагонка / ДВП",
        "prices": {
          "7x2.43": 90000,
          "6x2.4": 72000,
          "5x2.43": 67000,
          "4x2.3": 62000,
          "3x2.3": 57000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "Вагонка / ОСБ",
        "prices": {
          "7x2.43": 108000,
          "6x2.4": 88000,
          "5x2.43": 83000,
          "4x2.3": 78000,
          "3x2.3": 73000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "Вагонка / Вагонка",
        "prices": {
          "7x2.43": 115000,
          "6x2.4": 97000,
          "5x2.43": 92000,
          "4x2.3": 87000,
          "3x2.3": 82000
        },
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "С8 цвет / ДВП",
        "prices": {},
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "С8 цвет / ОСБ",
        "prices": {},
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      },
      {
        "name": "С8 цвет / Ваг",
        "prices": {},
        "assembly": {
          "7x2.43": 0,
          "6x2.4": 0,
          "5x2.43": 0,
          "4x2.3": 0,
          "3x2.3": 0
        }
      }
    ],
    "floorOptions": [
      {
        "id": "osb_18",
        "name": "Пол ОСБ 18 мм",
        "prices": {
          "7x2.43": 7500,
          "6x2.4": 6500,
          "5x2.43": 6000,
          "4x2.3": 5000,
          "3x2.3": 5000
        }
      },
      {
        "id": "linoleum",
        "name": "Линолеум",
        "prices": {
          "7x2.43": 15000,
          "6x2.4": 13000,
          "5x2.43": 11000,
          "4x2.3": 9500,
          "3x2.3": 7500
        }
      },
      {
        "id": "rodent_mesh",
        "name": "Решетка от грызунов",
        "prices": {
          "7x2.43": 4000,
          "6x2.4": 4000,
          "5x2.43": 4000,
          "4x2.3": 2500,
          "3x2.3": 2500
        }
      },
      {
        "id": "close_bottom_boards",
        "name": "Закрыть дно досками",
        "prices": {
          "7x2.43": 9000,
          "6x2.4": 7500,
          "5x2.43": 6500,
          "4x2.3": 3000,
          "3x2.3": 3000
        }
      }
    ],
    "insulation": [
      {
        "id": "insulation_100",
        "name": "Утеплитель 100-ка",
        "prices": {
          "7x2.43": 25000,
          "6x2.4": 25000,
          "5x2.43": 25000,
          "4x2.3": 25000,
          "3x2.3": 25000
        }
      }
    ],
    "additions": [
      {
        "id": "tr_add_20",
        "name": "Окно дер, 2 осткл, 70*80 см",
        "price": 2000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_21",
        "name": "Окно дер, 2 осткл, 50*50 см",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_22",
        "name": "Окно ПВХ повр-отк 70*80 см",
        "price": 7000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_23",
        "name": "Окно ПВХ повр-отк 90х90",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_24",
        "name": "Дверь вход Металл РФ 86*207 см",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_25",
        "name": "Дверь филёнчатая межкомнатн.",
        "price": 7000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_26",
        "name": "Дверь вход дерево каркасная наборная",
        "price": 3000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_27",
        "name": "Перегор. ДВП без утеплит до 2,2м",
        "price": 6000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_28",
        "name": "Перегор. ДВП с утеплит +50мм до 2,2м",
        "price": 7000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_30",
        "name": "Перегородка ОСБ с дверью ОСБ (9 см)",
        "price": 8000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_31",
        "name": "Перегородка Вагонка с дверью вагонка (9 см)",
        "price": 12000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_33",
        "name": "ПРОФЛИСТ ОКРАШЕННЫЙ",
        "price": 12000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "tr_add_34",
        "name": "Электрика автомат, кор-распределитель",
        "price": 5000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_35",
        "name": "Доп.точка электрики 1 шт",
        "price": 800,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_36",
        "name": "Покраска пропитка (1 слой)",
        "price": 10000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "tr_add_37",
        "name": "Покраска краской белой бруса каркаса, наличники",
        "price": 2000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "tr_add_38",
        "name": "Профлист цветной на крыше (0,35)",
        "price": 6000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "tr_add_39",
        "name": "Профлист цветной на крыше (0,45)",
        "price": 8000,
        "type": "area",
        "quantity": 0
      },
      {
        "id": "tr_add_40",
        "name": "ПВХ 1500х1500",
        "price": 25000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_41",
        "name": "ПВХ 2000х1500",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_42",
        "name": "Дровник",
        "price": 10000,
        "type": "quantity",
        "quantity": 0
      },
      {
        "id": "tr_add_43",
        "name": "Дверь входная ПВХ",
        "price": 31000,
        "type": "quantity",
        "quantity": 0
      }
    ],
    "delivery": {
      "baseDistance": 70,
      "basePrice": 12000,
      "pricePerKm": 130,
      "notes": "Доставка до 70 км = 12000 р. Свыше 1 км * 130 р (манипулятор)"
    }
  }
];